import React, { Component } from 'react';
import {Article} from './styles'

export default class PrivacyPolicy extends Component {
  render() {
    return (
      <Article>
        <section>
          <h1>ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ</h1>
          <p>г. Саратов «14» апреля 2018 г.</p>
          <p>Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в
            отношении всей информации, которую Веб-приложение «Daily Спасибо», расположенное на доменном имени <a
              href="https://spasibo.dergunov.net">spasibo.dergunov.net</a>, может получить о Пользователе во время
            использования Приложения, программ и продуктов Приложения.</p>
        </section>
        <section>
          <h2>1. ОСНОВНЫЕ ПОНЯТИЯ</h2>
          <dl>
            <dt>Приложение –</dt>
            <dd>веб-приложение (сайт), расположенный в сети Интернет по адресу: <a
              href="https://spasibo.dergunov.net">spasibo.dergunov.net</a>, а также база данных, для работы сайта.
            </dd>
            <dt>Администрация Приложения –</dt>
            <dd>группа физических лиц, имеющих полный доступ к настройкам и исходному коду Приложения, а также к
              информации,
              предоставленной пользователями Приложения. Пользователь в праве связаться напрямую с Администрацией
              Приложения
              по электронному аресу <a href="mailto:dmitry@dergunov.net">dmitry@dergunov.net</a>
            </dd>
            <dt>Пользователь –</dt>
            <dd>физическое лицо, разместившее свою персональную информацию посредством регистрации в Приложении.</dd>
          </dl>
        </section>
        <section>
          <h2>2. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
          <p>2.1. Настоящая Политика конфиденциальности является официальным типовым документом Администрации Приложения
            и
            определяет порядок обработки и защиты информации о физических лицах, использующих Форму регистрации в
            Приложении.</p>
          <p>2.2. Целью настоящей Политики конфиденциальности является обеспечение надлежащей защиты информации о
            Пользователе, в т.ч. его персональных данных от несанкционированного доступа и разглашения.</p>
          <p>2.3. Отношения, связанные со сбором, хранением, распространением и защитой информации о пользователях
            регулируются настоящей Политикой конфиденциальности и действующим законодательством Российской
            Федерации.</p>
          <p>2.4. Действующая редакция Политики конфиденциальности, является публичным документом, разработана
            Администрацией
            Приложения и доступна любому Пользователю сети Интернет при переходе по гипертекстовой ссылке <a
              href="https://spasibo.dergunov.net/privacy-policy">«Политика конфиденциальности»</a>.</p>
          <p>2.5. Администрация Приложения вправе вносить изменения в настоящую Политику конфиденциальности.</p>
          <p>2.6. При внесении изменений в Политику конфиденциальности, Администрация Приложения уведомляет об этом
            Пользователя путём размещения новой редакции Политики конфиденциальности по адресу <a
              href="https://spasibo.dergunov.net/privacy-policy">spasibo.dergunov.net/privacy-policy</a>.
          </p>
          <p>2.7. При размещении новой редакции Политики конфиденциальности в Приложении, предыдущая редакция хранятся в
            архиве документации Администрации Приложения.</p>
          <p>2.8. Используя Форму регистрации, Пользователь выражает свое согласие с условиями настоящей Политики
            конфиденциальности.</p>
          <p>2.9. Администрация Приложения не проверяет достоверность получаемой (собираемой) информации о
            Пользователе.</p>
        </section>
        <section>
          <h2>3. УСЛОВИЯ И ЦЕЛИ СБОРА И ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ ПОЛЬЗОВАТЕЛЕЙ</h2>
          <p>3.1. Персональные данные Пользователя такие как: имя, фамилия, e-mail передаются Пользователем
            Администрации
            Приложения с согласия Пользователя.</p>
          <p>3.2. Передача персональных данных Пользователем Администрации Приложения, через Форму обратной связи
            означает
            согласие Пользователя на передачу его персональных данных.</p>
          <p>3.3. Администрация Приложения осуществляет обработку информации о Пользователе, в т.ч. его персональных
            данных,
            таких как: имя, фамилия, e-mail в целях выполнения обязательств перед Пользователем Приложения.</p>
          <p>3.4. Обработка персональных данных осуществляется на основе принципов:</p>
          <ol type="a">
            <li>законности целей и способов обработки персональных данных и добросовестности;</li>
            <li>соответствия целей обработки персональных данных целям, заранее определенным и заявленным при сборе
              персональных данных;
            </li>
            <li>соответствия объёма и характера обрабатываемых персональных данных способам обработки персональных
              данных и
              целям обработки персональных данных;
            </li>
            <li>недопустимости объединения созданных для несовместимых между собой целей баз данных, содержащих
              персональные
              данные.
            </li>
          </ol>
          <p>3.5. Администрация Приложения осуществляет обработку персональных данных Пользователя с его согласия в
            целях
            оказания услуг/продажи товаров, предлагаемых в Приложении.</p>
        </section>
        <section>
          <h2>4. ХРАНЕНИЕ И ИСПОЛЬЗОВАНИЕ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
          <p>Персональные данные Пользователя хранятся исключительно на электронных носителях и используются строго по
            назначению, оговоренному в п.3 настоящей Политики конфиденциальности.</p>
        </section>
        <section>
          <h2>5. ПЕРЕДАЧА ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
          <p>5.1. Персональные данные Пользователя не передаются каким-либо третьим лицам, за исключением случаев, прямо
            предусмотренных настоящей Политикой конфиденциальности.</p>
          <p>5.2. Предоставление персональных данных Пользователя по запросу государственных органов, органов местного
            самоуправления осуществляется в порядке, предусмотренном законодательством Российской Федерации.</p>
        </section>
        <section>
          <h2>6. СРОКИ ХРАНЕНИЯ И УНИЧТОЖЕНИЕ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
          <p>6.1. Персональные данные Пользователя хранятся на электронном носителе сайта бессрочно.</p>
          <p>6.2. Персональные данные Пользователя уничтожаются при желании самого пользователя на основании его
            обращения,
            либо по инициативе Администратора сайта без объяснения причин путём удаления Администрацией Приложения
            информации,
            размещённой Пользователем.</p>
        </section>
        <section>
          <h2>7. ПРАВА И ОБЯЗАННОСТИ ПОЛЬЗОВАТЕЛЕЙ</h2>
          <p>Пользователи вправе на основании запроса получать от Администрации Приложения информацию, касающуюся
            обработки
            его персональных данных.</p>
        </section>
        <section>
          <h2>8. МЕРЫ ПО ЗАЩИТЕ ИНФОРМАЦИИ О ПОЛЬЗОВАТЕЛЯХ</h2>
          <p>Администратор Приложения принимает технические и организационно-правовые меры в целях обеспечения защиты
            персональных данных Пользователя от неправомерного или случайного доступа к ним, уничтожения, изменения,
            блокирования, копирования, распространения, а также от иных неправомерных действий.</p>
        </section>
        <section>
          <h2>9. ОБРАЩЕНИЯ ПОЛЬЗОВАТЕЛЕЙ</h2>
          <p>9.1. Пользователь вправе направлять Администрации Приложения свои запросы, в т.ч. относительно
            использования/удаления его персональных данных, предусмотренные п.3 настоящей Политики конфиденциальности в
            письменной форме по электронному адресу, указанному в п.1.</p>
          <p>9.2. Запрос, направляемый Пользователем, должен содержать следующую информацию:</p>
          <ul>
            <li>номер основного документа, удостоверяющего личность Пользователя или его представителя;</li>
            <li>сведения о дате выдачи указанного документа и выдавшем его органе;</li>
            <li>дату регистрации через Форму регистрации в Приложении;</li>
            <li>текст запроса в свободной форме;</li>
          </ul>
          <p>9.3. Администрация Приложения обязуется рассмотреть и направить ответ на поступивший запрос Пользователя в
            течение 30 дней с момента поступления обращения.</p>
          <p>9.4. Вся обращения в электронной форме, полученные Администрацией от Пользователя относятся к информации
            ограниченного доступа и без письменного согласия Пользователя разглашению не подлежит. Персональные данные и
            иная
            информация о Пользователе, направившем запрос, не могут быть без специального согласия Пользователя
            использованы
            иначе, как для ответа по теме полученного запроса или в случаях, прямо предусмотренных
            законодательством.</p>
        </section>
        <section>
          <p>Обновлено «14» апреля 2018 г.</p>
        </section>
      </Article>
    );
  }
}